const scheduleData = {
    "Январь": null, 
    "Февраль": null,
    "Март": null,
    "Апрель": [
        { name: "Лагутенков Р.С.", shifts: ["ПХ", "", "D", "D", "W", "", "S", "N", "", "", "D", "W", "", "D", "N", "", "N", "W", "N", "", "", "D", "N", "N", "W", "D", "N", "", "", ""], s: 14, h: 164 },
        { name: "Миронов С.А.", shifts: ["ПХ", "", "D", "D", "W", "", "", "N", "", "S", "D", "W", "", "D", "N", "", "N", "W", "N", "", "", "D", "N", "N", "W", "D", "N", "", "", ""], s: 14, h: 164 },
        { name: "Куштанов А.А.", shifts: ["", "D", "N", "N", "W", "S", "N", "", "", "D", "N", "W", "", "D", "N", "", "D", "W", "", "", "D", "N", "", "", "W", "N", "", "", "D", ""], s: 14, h: 164 },
        { name: "Рыжих И.Н.", shifts: ["", "", "", "W", "W", "", "", "", "", "", "W", "W", "", "", "", "", "D", "W", "", "", "D", "N", "", "", "W", "N", "", "", "D", ""], s: 5, h: 60 },
        { name: "Бондаренко Т.А.", shifts: ["О", "О", "", "W", "W", "О", "О", "", "", "О", "W", "W", "", "О", "", "", "О", "W", "", "О", "О", "", "", "О", "W", "О", "О", "", "", ""], s: 0, h: "ОТП" }
    ],
    "Май": "future",
    "Июнь": "future",
    "Июль": "future",
    "Август": "future",
    "Сентябрь": "future",
    "Октябрь": "future",
    "Ноябрь": "future",
    "Декабрь": "future"
};