const scheduleData = {
    "Январь": null, 
    "Февраль": null,
    "Март": null,
    "Апрель": [
        { name: "Лагутенков Р.С.", shifts: ["ПХ", "", "D", "D", "W", "", "S", "N", "", "", "D", "W", "", "D", "N", "", "N", "W", "N", "", "", "D", "N", "N", "W", "D", "N", "", "", ""] },
        { name: "Миронов С.А.", shifts: ["ПХ", "", "D", "D", "W", "", "", "N", "", "S", "D", "W", "", "D", "N", "", "N", "W", "N", "", "", "D", "N", "N", "W", "D", "N", "", "", ""] },
        { name: "Куштанов К.А.", shifts: ["", "D", "N", "N", "W", "S", "N", "", "", "D", "N", "W", "", "D", "N", "", "D", "W", "", "", "D", "N", "", "", "W", "N", "", "", "D", ""] },
        { name: "Сучков Д.В.", shifts: ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "N", "", "", "D"] },
        { name: "Рыжих И.Н.", shifts: ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "D", "", "", "", "D", "N", "", "", "", "N", "", "", "D"] },
        { name: "Бондаренко Т.А.", shifts: ["О", "О", "", "W", "W", "О", "О", "", "", "О", "W", "W", "", "О", "", "", "О", "W", "", "О", "О", "", "", "О", "W", "О", "О", "", "", ""] }
    ],
    "Май": "future",
    "Июнь": "future",
    "Июль": "future",
    "Август": "future",
    "Сентябрь": "future",
    "Октябрь": "future",
    "Ноябрь": "future",
    "Декабрь": "future"
};